In [1]:
import pandas as pd

In [ ]:
df = pd.read_csv("e:/Nisreen/Desktop/machine learning/data.csv")
print(df)

In [48]:
Team = {"Name":["Nisreen","Sara","Tom","Mohamed"],
            "Position":["Manager,Computer Engineer","Graphic Design","Web Developer","Manager,IT specialist"],
       "Salary":[20000,10500,12000,20000]}
TeamData = pd.DataFrame(Team)
print(TeamData)

      Name                   Position  Salary
0  Nisreen  Manager,Computer Engineer   20000
1     Sara             Graphic Design   10500
2      Tom              Web Developer   12000
3  Mohamed      Manager,IT specialist   20000

In [49]:
head = TeamData.head()
print(head)

      Name                   Position  Salary
0  Nisreen  Manager,Computer Engineer   20000
1     Sara             Graphic Design   10500
2      Tom              Web Developer   12000
3  Mohamed      Manager,IT specialist   20000

In [50]:
print(TeamData.columns)

Index(['Name', 'Position', 'Salary'], dtype='object')

In [51]:
print(TeamData.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Position  4 non-null      object
 2   Salary    4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [52]:
print(TeamData.dtypes)

Name        object
Position    object
Salary       int64
dtype: object

In [53]:
print(TeamData.describe())

            Salary
count      4.00000
mean   15625.00000
std     5088.79488
min    10500.00000
25%    11625.00000
50%    16000.00000
75%    20000.00000
max    20000.00000

In [54]:
print(TeamData["Position"])

0    Manager,Computer Engineer
1               Graphic Design
2                Web Developer
3        Manager,IT specialist
Name: Position, dtype: object

In [20]:
print(TeamData["Name"])

0    Nisreen
1       Sara
2        Tom
3    Mohamed
Name: Name, dtype: object

In [55]:
print(TeamData.loc[:,"Salary"])

0    20000
1    10500
2    12000
3    20000
Name: Salary, dtype: int64

In [59]:
TeamData["Age"]= [21,21,25,23]

In [60]:
print(TeamData)

      Name                   Position  Salary  age  Age
0  Nisreen  Manager,Computer Engineer   20000   21   21
1     Sara             Graphic Design   10500   21   21
2      Tom              Web Developer   12000   25   25
3  Mohamed      Manager,IT specialist   20000   23   23

In [61]:
print(TeamData.loc[:3,"Age"])

0    21
1    21
2    25
3    23
Name: Age, dtype: int64

In [62]:
print(TeamData.loc[1:3,"Age"])

1    21
2    25
3    23
Name: Age, dtype: int64

In [63]:
print(TeamData.loc[:3,"Name"])

0    Nisreen
1       Sara
2        Tom
3    Mohamed
Name: Name, dtype: object

In [64]:
print(TeamData.loc[::-1])

      Name                   Position  Salary  age  Age
3  Mohamed      Manager,IT specialist   20000   23   23
2      Tom              Web Developer   12000   25   25
1     Sara             Graphic Design   10500   21   21
0  Nisreen  Manager,Computer Engineer   20000   21   21

In [65]:
TeamFilter= TeamData.age>23
TeamData["Bool"]=TeamFilter
print(TeamData.loc[:,["Age","Bool"]])

   Age   Bool
0   21  False
1   21  False
2   25   True
3   23  False

In [66]:
del TeamData["age"]

In [67]:
print(TeamData)

      Name                   Position  Salary  Age   Bool
0  Nisreen  Manager,Computer Engineer   20000   21  False
1     Sara             Graphic Design   10500   21  False
2      Tom              Web Developer   12000   25   True
3  Mohamed      Manager,IT specialist   20000   23  False

In [69]:
TeamFilter2 = TeamData.Salary<20000
Filtered=TeamData[TeamFilter&TeamFilter2]
print(Filtered)

  Name       Position  Salary  Age  Bool
2  Tom  Web Developer   12000   25  True

In [70]:
TeamData.dropna(inplace=True)
TeamData

      Name                   Position  Salary  Age   Bool
0  Nisreen  Manager,Computer Engineer   20000   21  False
1     Sara             Graphic Design   10500   21  False
2      Tom              Web Developer   12000   25   True
3  Mohamed      Manager,IT specialist   20000   23  False

In [80]:
TeamData["WorkPlace"]=["remote" if TeamData.Salary.mean()>each else "On-Site" for each in TeamData.Salary]
TeamData

      Name                   Position  Salary  Age   Bool WorkPlace
0  Nisreen  Manager,Computer Engineer   20000   21  False   On-Site
1     Sara             Graphic Design   10500   21  False    remote
2      Tom              Web Developer   12000   25   True    remote
3  Mohamed      Manager,IT specialist   20000   23  False   On-Site

In [83]:
TeamData.columns = [each.split('_')[0]+ " "+ each.split('_')[1] if len(each.split('_'))>1 else each for each in TeamData.columns]
TeamData

      Name                   Position  Salary  Age   Bool WorkPlace
0  Nisreen  Manager,Computer Engineer   20000   21  False   On-Site
1     Sara             Graphic Design   10500   21  False    remote
2      Tom              Web Developer   12000   25   True    remote
3  Mohamed      Manager,IT specialist   20000   23  False   On-Site

In [84]:
TeamData.columns=[each.upper() for each in TeamData.columns]
TeamData.columns

Index(['NAME', 'POSITION', 'SALARY', 'AGE', 'BOOL', 'WORKPLACE'], dtype='object')

In [85]:
Data1=TeamData.head()
Data2=TeamData.tail()
connect=pd.concat([Data1,Data2],axis=0)
connect

      NAME                   POSITION  SALARY  AGE   BOOL WORKPLACE
0  Nisreen  Manager,Computer Engineer   20000   21  False   On-Site
1     Sara             Graphic Design   10500   21  False    remote
2      Tom              Web Developer   12000   25   True    remote
3  Mohamed      Manager,IT specialist   20000   23  False   On-Site
0  Nisreen  Manager,Computer Engineer   20000   21  False   On-Site
1     Sara             Graphic Design   10500   21  False    remote
2      Tom              Web Developer   12000   25   True    remote
3  Mohamed      Manager,IT specialist   20000   23  False   On-Site

In [89]:
TeamData["Extra"]= [each/4 for each in TeamData.SALARY]
TeamData

      NAME                   POSITION  SALARY  AGE   BOOL WORKPLACE   Extra
0  Nisreen  Manager,Computer Engineer   20000   21  False   On-Site  5000.0
1     Sara             Graphic Design   10500   21  False    remote  2625.0
2      Tom              Web Developer   12000   25   True    remote  3000.0
3  Mohamed      Manager,IT specialist   20000   23  False   On-Site  5000.0

In [90]:
def bonus(salary):
    return salary/4
TeamData["Bonus"] = TeamData.Extra.apply(bonus)
TeamData

,NAME,POSITION,SALARY,AGE,BOOL,WORKPLACE,Extra,Bonus
0,Nisreen,"Manager,Computer Engineer",20000,21,False,On-Site,5000.0,1250.00
1,Sara,Graphic Design,10500,21,False,remote,2625.0,656.25
2,Tom,Web Developer,12000,25,True,remote,3000.0,750.00
3,Mohamed,"Manager,IT specialist",20000,23,False,On-Site,5000.0,1250.00